Your read_csv() call to import the CSV data didn't generate an error, but the output is not entirely what we wanted. The row labels were imported as another column without a name.

Remember index_col, an argument of read_csv(), that you can use to specify which column in the CSV file should be used as a row label? Well, that's exactly what you need here!

Python code that solves the previous exercise is already included; can you make the appropriate changes to fix the data import?

In [93]:
# Import pandas as pd
import pandas as pd

### Specify the index_col argument inside pd.read_csv(): set it to 0, so that the first column is used as row labels.

In [94]:
# Fix import by including index_col
cars = pd.read_csv('cars.csv',index_col=0)

In [95]:
# Print out cars
print(cars)

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False
IN             18          India         False
RU            200         Russia          True
MOR            70        Morocco          True
EG             45          Egypt          True

In [96]:
cars.set_index('drives_right')

              cars_per_cap        country
drives_right
True                   809  United States
False                  731      Australia
False                  588          Japan
False                   18          India
True                   200         Russia
True                    70        Morocco
True                    45          Egypt

it replace the previous index

In [97]:
print(cars.columns)

Index(['cars_per_cap', 'country', 'drives_right'], dtype='object')

In [101]:
cars = pd.read_csv('cars.csv')
cars

  Unnamed: 0  cars_per_cap        country  drives_right
0         US           809  United States          True
1        AUS           731      Australia         False
2        JAP           588          Japan         False
3         IN            18          India         False
4         RU           200         Russia          True
5        MOR            70        Morocco          True
6         EG            45          Egypt          True

In [109]:
cars.columns=['short_from','cars_per_cap', 'country', 'drives_right']
cars

     short_from  cars_per_cap        country  drives_right
zero         US           809  United States          True
one         AUS           731      Australia         False
2           JAP           588          Japan         False
3            IN            18          India         False
4            RU           200         Russia          True
5           MOR            70        Morocco          True
6            EG            45          Egypt          True

In [110]:
cars.rename(columns={'country':'COUNTRY'},inplace=True)
cars.columns
cars

     short_from  cars_per_cap        COUNTRY  drives_right
zero         US           809  United States          True
one         AUS           731      Australia         False
2           JAP           588          Japan         False
3            IN            18          India         False
4            RU           200         Russia          True
5           MOR            70        Morocco          True
6            EG            45          Egypt          True

In [104]:
cars.rename(columns=lambda x: x[0:3], inplace=True)

In [105]:
cars

   sho  car            COU    dri
0   US  809  United States   True
1  AUS  731      Australia  False
2  JAP  588          Japan  False
3   IN   18          India  False
4   RU  200         Russia   True
5  MOR   70        Morocco   True
6   EG   45          Egypt   True

In [111]:
cars.rename(index={0:'zero',1:'one'}, inplace=True)

In [112]:
cars

     short_from  cars_per_cap        COUNTRY  drives_right
zero         US           809  United States          True
one         AUS           731      Australia         False
2           JAP           588          Japan         False
3            IN            18          India         False
4            RU           200         Russia          True
5           MOR            70        Morocco          True
6            EG            45          Egypt          True